Revit 2027 API
FamilySizeTableColumn.GetUnitTypeId Method
 Gets the identifier of the unit quantifying values in the column.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ForgeTypeId GetUnitTypeId()
Public Function GetUnitTypeId As ForgeTypeId
public:
ForgeTypeId^ GetUnitTypeId()
member GetUnitTypeId : unit -> ForgeTypeId
Return Value
ForgeTypeId
 Identifier of the unit.
See Also
Reference
FamilySizeTableColumn Class
Autodesk.Revit.DB Namespace